book2/app/controllers/books_controller.rb

SELECT `books`.* FROM `books` INNER JOIN `books_users` ON `books_users`.book_id = `books`.id INNER JOIN `users` ON `users`.id = `books_users`.user_id WHERE (user_id != 1) GROUP BY title ORDER BY title
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `books` ORDER BY title
---
	def index
		@choice = params[:choice]

		case @choice
			when "mine"
				books = @user.books.find(:all, :order => 'title')
			when "others"
				books = Book.find(:all, :conditions => ['user_id != ?', @user.id], :joins => :users, :group => "title", :order => "title")
			else
				books = Book.find(:all, :order => "title")
		end

		@books = books.paginate :page => params[:page], :per_page => 10

SELECT * FROM `books` WHERE (`books`.`id` = 3)
---
	def show
		@book = Book.find(params[:id])

INSERT INTO `books` (`author_last`, `created_at`, `title`, `publish_year`, `updated_at`, `author_first`) VALUES('Ruby', '2010-09-22 15:08:14', 'Agile Web Development with Rails', 2009, '2010-09-22 15:08:14', 'Sam')
---
	def create
		@book = Book.new(params[:book])
		@book.title = @book.title.titleize
		@book.author_first = @book.author_first.titleize
		@book.author_last = @book.author_last.titleize
		@all_categories = get_all_categories

		respond_to do |format|
			if @book.save

SELECT * FROM `books` WHERE (`books`.`id` = 4)
---
	def add_to_favs
		@book = Book.find(params[:id])

SELECT * FROM `books` WHERE (`books`.`id` = 3)
---
	def delete_from_favs
		@book = Book.find(params[:id])