book2/app/controllers/users_controller.rb

  def login
    if request.post?
      user = User.authenticate(params[:username], params[:password])

      if user
        session[:user_id] = user.id
        flash[:notice] = "Welcome, #{user.first_name}!"
---
SELECT * FROM `users` WHERE (`users`.`username` = '') LIMIT 1